public_html/Books Review/The Standard C Library/The Standard C Library.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>The Standard C Library</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="The Standard C Library"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-10T22:35+0800"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">The Standard C Library</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Chapter 1: &lt;assert.h&gt;</a>
<ul>
<li><a href="#sec-1-1">macro NDEBUG</a></li>
</ul>
</li>
<li><a href="#sec-2">Chapter 2: &lt;ctype.h&gt;</a></li>
<li><a href="#sec-3">Chapter 3: &lt;errno.h&gt;</a></li>
<li><a href="#sec-4">Chapter 4: &lt;float. h&gt;</a></li>
<li><a href="#sec-5">Chapter 5: &lt;1imits.h&gt;</a></li>
<li><a href="#sec-6">Chapter 6: &lt;locale. h&gt;</a>
<ul>
<li><a href="#sec-6-1">The type is</a></li>
<li><a href="#sec-6-2">Macros:</a></li>
<li><a href="#sec-6-3">The setlocale function</a></li>
<li><a href="#sec-6-4">The localeconv function</a></li>
<li><a href="#sec-6-5">library changes</a></li>
</ul>
</li>
<li><a href="#sec-7">Chapter 7: &lt;math. h&gt;</a>
<ul>
<li><a href="#sec-7-1">The acos function</a></li>
<li><a href="#sec-7-2">The asin function</a></li>
<li><a href="#sec-7-3">The atan function</a></li>
<li><a href="#sec-7-4">The atan2 function</a></li>
<li><a href="#sec-7-5">The cos function</a></li>
<li><a href="#sec-7-6">The sin function</a></li>
<li><a href="#sec-7-7">The tan function</a></li>
<li><a href="#sec-7-8">The cosh function</a></li>
<li><a href="#sec-7-9">The sinh function</a></li>
<li><a href="#sec-7-10">The tanh function</a></li>
<li><a href="#sec-7-11">The exp function</a></li>
<li><a href="#sec-7-12">The frexp function</a></li>
<li><a href="#sec-7-13">The ldexp function</a></li>
<li><a href="#sec-7-14">The log function</a></li>
<li><a href="#sec-7-15">The log10 function</a></li>
<li><a href="#sec-7-16">The modf function</a></li>
<li><a href="#sec-7-17">The pow function</a></li>
<li><a href="#sec-7-18">The sqrt function</a></li>
<li><a href="#sec-7-19">The ceil function</a></li>
<li><a href="#sec-7-20">The fabs function</a></li>
<li><a href="#sec-7-21">The floor function</a></li>
<li><a href="#sec-7-22">The fmod function</a></li>
</ul>
</li>
<li><a href="#sec-8">Chapter 8: &lt;setjmp. h&gt;</a></li>
<li><a href="#sec-9">Chapter 9: &lt;signal.h&gt;</a></li>
<li><a href="#sec-10">Chapter 10: &lt;stdarg.h&gt;</a></li>
<li><a href="#sec-11">Chapter 11: &lt;stddef.h&gt;</a></li>
<li><a href="#sec-12">Chapter 12: &lt;stdio.h&gt;</a>
<ul>
<li><a href="#sec-12-1">The perror function</a></li>
<li><a href="#sec-12-2">print functions</a></li>
<li><a href="#sec-12-3">scan functions</a></li>
</ul>
</li>
<li><a href="#sec-13">Chapter 13: &lt;stdlib. h&gt;</a>
<ul>
<li><a href="#sec-13-1">function groups</a></li>
<li><a href="#sec-13-2">strtod</a></li>
<li><a href="#sec-13-3">strtoul</a></li>
<li><a href="#sec-13-4">getenv</a></li>
<li><a href="#sec-13-5">bsearch</a></li>
<li><a href="#sec-13-6">qsort</a></li>
<li><a href="#sec-13-7">div</a></li>
<li><a href="#sec-13-8">mblen</a></li>
<li><a href="#sec-13-9">mbtowc</a></li>
<li><a href="#sec-13-10">wctomb</a></li>
<li><a href="#sec-13-11">mbstowcs</a></li>
<li><a href="#sec-13-12">wcstombs</a></li>
</ul>
</li>
<li><a href="#sec-14">Chapter 14: &lt;string.h&gt;</a>
<ul>
<li><a href="#sec-14-1">strcoll</a></li>
<li><a href="#sec-14-2">strxfrm</a></li>
<li><a href="#sec-14-3">memchr</a></li>
<li><a href="#sec-14-4">strchr</a></li>
<li><a href="#sec-14-5">strcspn</a></li>
<li><a href="#sec-14-6">strpbrk</a></li>
<li><a href="#sec-14-7">strrchr</a></li>
<li><a href="#sec-14-8">strspn</a></li>
<li><a href="#sec-14-9">strtok</a></li>
<li><a href="#sec-14-10">strerror</a></li>
</ul>
</li>
<li><a href="#sec-15">Chapter 15: &lt;time.h&gt;</a>
<ul>
<li><a href="#sec-15-1">macro CLOCKS<sub>PER</sub><sub>SEC</sub></a></li>
<li><a href="#sec-15-2">clock<sub>t</sub> and time<sub>t</sub></a></li>
<li><a href="#sec-15-3">struct tm</a></li>
<li><a href="#sec-15-4">clock</a></li>
<li><a href="#sec-15-5">difftime</a></li>
<li><a href="#sec-15-6">mktime</a></li>
<li><a href="#sec-15-7">time</a></li>
<li><a href="#sec-15-8">asctime</a></li>
<li><a href="#sec-15-9">ctime</a></li>
<li><a href="#sec-15-10">gmtime</a></li>
<li><a href="#sec-15-11">localtime</a></li>
<li><a href="#sec-15-12">strftime</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Chapter 1: &lt;assert.h&gt;</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">macro NDEBUG</h3>
<div class="outline-text-3" id="text-1-1">


<p>
The header &lt;assert.h&gt; defines the assert macro and refers to another macro,
NDEBUG
which is not defined by &lt;assert.h&gt;.If NDEBUG is defined as a macro name at the point in
the source file where &lt;assert.h&gt; is included, the assert macro is defined simply as
</p>
<p>
<code>#define assert(ignore) ((void) 0)</code>
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Chapter 2: &lt;ctype.h&gt;</h2>
<div class="outline-text-2" id="text-2">





<pre class="src src-sh">ispunct: !<span style="color: #ffa07a;">"#$%bf ()*+, -./: ;&lt;=&gt;?@[\IA-'{))-</span>
<span style="color: #ffa07a;">isdigit: 0123456789</span>
<span style="color: #ffa07a;">islower: abcdefghijklmnopqrstuvwxyz</span>
<span style="color: #ffa07a;">isupper: ABCDEFGHIJKLMNOPQRSTUVWXYZ</span>
<span style="color: #ffa07a;">isalpha: ABCDEFGHIJKLMNOPQRSTWWXYZabcdefghijklmnopqrstuvarxyz</span>
<span style="color: #ffa07a;">isalnum: 0123456789ABCDEFGHIJKLMNOPQRSTWWXYZabcdefghijklmnopqrstuvarxyz</span>
</pre>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Chapter 3: &lt;errno.h&gt;</h2>
<div class="outline-text-2" id="text-3">

<p>The header &lt;errno.h&gt; defines several macros, all relating to the
reporting of error conditions.
</p>
<p>
The macros are
</p>


<pre class="src src-sh">EDOM
ERANGE
</pre>


<p>
Use:
</p>


<pre class="src src-c"><span style="color: #b0c4de;"> #include</span> <span style="color: #ffa07a;">&lt;errno.h&gt;</span>
errno == EDOM
</pre>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Chapter 4: &lt;float. h&gt;</h2>
<div class="outline-text-2" id="text-4">

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Chapter 5: &lt;1imits.h&gt;</h2>
<div class="outline-text-2" id="text-5">




<pre class="src src-sh">  CHAR_BIT   8
  SCHAR_MIN  -127
  SCHAR_MAX  +127
  UCHAR_MAX  255
  INT_MIN    -32767
  INT_MAX    +32767
  UINT_MAX   65535
...
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Chapter 6: &lt;locale. h&gt;</h2>
<div class="outline-text-2" id="text-6">

<p>The header &lt;locale. h&gt; declares two functions, one type, and defines
several macros.
</p>

</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">The type is</h3>
<div class="outline-text-3" id="text-6-1">

<p><code>etruct lconv</code>
</p>
</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2">Macros:</h3>
<div class="outline-text-3" id="text-6-2">




<pre class="src src-sh">LC_ALL
LGOLLATE
LC_CTYPE
LC_MONETARY
LC_NUMERIC
</pre>

</div>

</div>

<div id="outline-container-6-3" class="outline-3">
<h3 id="sec-6-3">The setlocale function</h3>
<div class="outline-text-3" id="text-6-3">

<p><code>char *setlocale(int category, conet char *locale);</code>
</p>
<p>
<code>setlocale(LC_AU, " C " ) ;</code>
</p>
</div>

</div>

<div id="outline-container-6-4" class="outline-3">
<h3 id="sec-6-4">The localeconv function</h3>
<div class="outline-text-3" id="text-6-4">

<p><code>struct lconv *localeconv(void);</code>
</p>
</div>

</div>

<div id="outline-container-6-5" class="outline-3">
<h3 id="sec-6-5">library changes</h3>
<div class="outline-text-3" id="text-6-5">

<p>Here are all the places where library behavior changes with locale:
</p>
<ul>
<li>The functions strcoll and strxrrm, declared in &lt;string. w, can
  change how they collate when category LC-COLLATE changes. The
  functions declared in &lt;ctype.h&gt;, the print and scan functions,
  declared in &lt;stdio . h&gt;, and the numeric conversion functions,
  declared in &lt;stdlib. w, can change how they test and alter certain
  characters when category LC-CTYPE changes.
</li>
<li>The multibyte functions, declared in &lt;stdlib. w, and the print and
  scan functions, declared in &lt;stdio. w, can change how they parse and
  translate multibyte strings when category LC-CTYPE changes.
</li>
<li>The print and scan functions, declared in &lt;stdio.w, and atof and
  strtod, declared in&lt;stdlib. w, can change what they use for
  thedecimal point character when category LCJUMERIC changes.
</li>
<li>The strrtime function, declared in &lt;time .w, can change how it
  converts times to character strings when category LC-TIME changes.
</li>
<li>The localeconv function, declared in &lt;locale .h&gt;, can change what it
  returns when categories LC-MONETARY or LC-NUMERIC change.
</li>
</ul>

</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Chapter 7: &lt;math. h&gt;</h2>
<div class="outline-text-2" id="text-7">


</div>

<div id="outline-container-7-1" class="outline-3">
<h3 id="sec-7-1">The acos function</h3>
<div class="outline-text-3" id="text-7-1">




<pre class="src src-c">Synopsis
<span style="color: #b0c4de;">    #include</span> <span style="color: #ffa07a;">&lt;math.h&gt;</span>
    <span style="color: #98fb98;">double</span> <span style="color: #87cefa;">ac</span> on(<span style="color: #98fb98;">doub1e</span> <span style="color: #eedd82;">x</span>);
Description
The acos function computes the principal value of the arc cosine <span style="color: #98fb98;">of</span> <span style="color: #eedd82;">x</span>. A domain error occurs
<span style="color: #00ffff;">for</span> arguments not in the range [-1. +1].
</pre>

<p>
Returns: 
  The acos function returns the arc cosine in the range [0, &pi;]
  radians
</p></div>

</div>

<div id="outline-container-7-2" class="outline-3">
<h3 id="sec-7-2">The asin function</h3>
<div class="outline-text-3" id="text-7-2">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double asin (double x);</code>
</p>
<p>
Description
The asin function computes the principal value of the arc sine of x. A domain error occurs
for arguments not in the range [-1, +1].
</p>
<p>
Returns
The asin function returns the arc sine in the range [-&pi;/2, +&pi;/2] radians.
</p>
</div>

</div>

<div id="outline-container-7-3" class="outline-3">
<h3 id="sec-7-3">The atan function</h3>
<div class="outline-text-3" id="text-7-3">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double atan(double x);</code>
</p>
<p>
Description
The atan function computes the principal value of the arc tangent of x.
</p>
<p>
Returns
The atan function returns the arc tangent in the range [-&pi;/2,
+&pi;/2] radians.
</p>



</div>

</div>
