src/BooksReview/The Standard C Library/The Standard C Library.org
** The atan2 function
Synopsis
=#includ. <math.h>=
=double atan2 (double y, double x) ;=

Description
The atan2 function computes the principal value of the arc tangent of y/x, using the signs
of both arguments to determine the quadrant of the return value. A domain error may occur if both
arguments are zero.

Returns
The atan2 function returns the arc tangent of y/x, in the range[-/pi,
+/pi] radians.
** The cos function
Synopsis
=#includa <math.h>=
=double con(double x);=

Description
The cos function computes the cosine of x (measured in radians).

Returns
The cos function returns the cosine value.

** The sin function
Synopsis
=#include <math.h>=
=double sin(double x);=

Description
The sin function computes the sine of x (measured in radians).

Returns
The sin function returns the sine value.



** The tan function
Synopsis
=#include <math.h>=
=double tan(doub1e x);=

Description
The tan function returns the tangent of x (measured in radians).

Returns
The tan function returns the tangent value.

** The cosh function
Synopsis
=#include <math.h>=
=double comh(doub1e x );=

Description
The cosh function computes the hyperbolic cosine of x. Arrange error
occurs if the magnitude of x is too large.

Returns
The cosh function returns the hyperbolic cosine value.
** The sinh function
Synopsis
=#includa <math.h>=
=double ainh(double x);=

Description
The sinh function computes the hyperbolic sine of x. A range error
occurs if the magnitude of x is too large.

Returns
The sinh function returns the hyperbolic sine value.












** The tanh function
Synopsis
=#include <math.h>=
=double tanh(doub1e x);=

Description
The tanh function computes the hyperbolic tangent of x.

Returns
The tanh function returns the hyperbolic tangent value.
** The exp function
Synopsis
=#include <math.h>=
=double exp (double x):=

Description
The exp function computes the exponential function of x. Arrange error
occurs if the magnitude of x is too large.

Returns
The exp function retums the exponential value.

** The frexp function
Synopsis
=#include <math.h>=
=double frexp(dbub1e value. int *exp);=

Description
The frexp function breaks a floating-point number into a normalized
fraction and an integral power of 2. It stores the integer in the i n t object pointed to by exp.

Returns
The frexp function returns the value x, such that x is a double with
magnitude in the interval [1/2, 1) or zero, and value equals x times 2
raised to the power *exp. If value is zero, both parts of the result are zero.



** The ldexp function
Synopsis
=#include <math.h>=
=dbuble ldexp(doub1e x, int exp);=

Description
The ldexp function multiplies a floating-point number by an integral
power of 2. A range error may occur.

Returns
The ldexp function retunls the value of x times 2 raised to the power exp.

** The log function
Synopsis
=#include <math.h>=
=double log(double x);=

Description
The log function computes the natural logarithm of x. A domain error
occurs if the argument is negative. A range error may occur if the
argument is zero.

Returns
The log function returns the natural logarithm.
** The log10 function
Synopsis
=#include <math.h>=
=double log10 (double x);=

Description
The log10 function computes the base-ten logarithm of x. A domain
error occurs if the argument is negative. A range error may occur if
the argument is zero.

Return
The log10 function returns the base-ten logarithm.
** The modf function
Synopsis
=#include <math.h>
=double modf(doub1e value, double aiptr);=

Description
The modf function breaks the argument value into integer and fraction
parts, each of which has the same sign as the argument. It stores the
integer part as a double in the object pointed to by iptr.

Returns
The modf function returns the signed fractional part of value.
** The pow function
Synopsis
=#include <math.h>=
=double pow(doub1e x, double y):=

Description
The p o w function computes x raised to the power y. A domain error
occurs if x is negative and y is not an integral value. A domain error
occurs if the result cannot be represented when x is zero and y is
less than or equal to zero. A range error may occur.

Returns
The p o w function returns the value of x raised to the power y.

** The sqrt function
Synopsis
=#include <math.h>=
=double mqrt(double x) ;=

Description
The sqrt function computes the nonnegative square root of x. A domain
error occurs if the argument is negative.

Returns
The sqrt function returns the value of the square root.

** The ceil function
Synopsis
=#include <math.h>=
=double ceil(doub1e x):=

Description
The ceil function computes the smallest integral value not less than x.

Returns
The ceil function returns the smallest integral value not less than x,
expressed as a double. 

** The fabs function
Synopsis
=#include <math.h>=
=double fabm(double x);=

Description
The fabs function computes the absolute value of a floating-point number X.

Returns
The fabs function returns the absolute value of X .

** The floor function
Synopsis
=#include <math.h>=
=double floor(doub1e x);=

Description
The floor function computes the largest integral value not greater than x.

Returns
The floor function returns the largest integral value not greater than x, expressed as a double.

** The fmod function
Synopsis
=#include <math.h>=
=double fmod(doublr x, double y ) ;=

Description
The fmod function computes the floating-point remainder of x/y.

Returns
The fmod function returns the value x - i * y, for some integer i such that, if y is nonzero,
the result has the same sign as x and magnitude less than the magnitude of y. If y is zero, whether
a domain error occurs or the fmod function returns zero is implementation-defined.

