public_html/Books Review/The Standard C Library/The Standard C Library.html

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4">The atan2 function</h3>
<div class="outline-text-3" id="text-7-4">

<p>Synopsis
<code>#includ. &lt;math.h&gt;</code>
<code>double atan2 (double y, double x) ;</code>
</p>
<p>
Description
The atan2 function computes the principal value of the arc tangent of y/x, using the signs
of both arguments to determine the quadrant of the return value. A domain error may occur if both
arguments are zero.
</p>
<p>
Returns
The atan2 function returns the arc tangent of y/x, in the range[-/pi,
+/pi] radians.
</p></div>

</div>

<div id="outline-container-7-5" class="outline-3">
<h3 id="sec-7-5">The cos function</h3>
<div class="outline-text-3" id="text-7-5">

<p>Synopsis
<code>#includa &lt;math.h&gt;</code>
<code>double con(double x);</code>
</p>
<p>
Description
The cos function computes the cosine of x (measured in radians).
</p>
<p>
Returns
The cos function returns the cosine value.
</p>
</div>

</div>

<div id="outline-container-7-6" class="outline-3">
<h3 id="sec-7-6">The sin function</h3>
<div class="outline-text-3" id="text-7-6">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double sin(double x);</code>
</p>
<p>
Description
The sin function computes the sine of x (measured in radians).
</p>
<p>
Returns
The sin function returns the sine value.
</p>


</div>

</div>

<div id="outline-container-7-7" class="outline-3">
<h3 id="sec-7-7">The tan function</h3>
<div class="outline-text-3" id="text-7-7">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double tan(doub1e x);</code>
</p>
<p>
Description
The tan function returns the tangent of x (measured in radians).
</p>
<p>
Returns
The tan function returns the tangent value.
</p>
</div>

</div>

<div id="outline-container-7-8" class="outline-3">
<h3 id="sec-7-8">The cosh function</h3>
<div class="outline-text-3" id="text-7-8">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double comh(doub1e x );</code>
</p>
<p>
Description
The cosh function computes the hyperbolic cosine of x. Arrange error
occurs if the magnitude of x is too large.
</p>
<p>
Returns
The cosh function returns the hyperbolic cosine value.
</p></div>

</div>

<div id="outline-container-7-9" class="outline-3">
<h3 id="sec-7-9">The sinh function</h3>
<div class="outline-text-3" id="text-7-9">

<p>Synopsis
<code>#includa &lt;math.h&gt;</code>
<code>double ainh(double x);</code>
</p>
<p>
Description
The sinh function computes the hyperbolic sine of x. A range error
occurs if the magnitude of x is too large.
</p>
<p>
Returns
The sinh function returns the hyperbolic sine value.
</p>











</div>

</div>

<div id="outline-container-7-10" class="outline-3">
<h3 id="sec-7-10">The tanh function</h3>
<div class="outline-text-3" id="text-7-10">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double tanh(doub1e x);</code>
</p>
<p>
Description
The tanh function computes the hyperbolic tangent of x.
</p>
<p>
Returns
The tanh function returns the hyperbolic tangent value.
</p></div>

</div>

<div id="outline-container-7-11" class="outline-3">
<h3 id="sec-7-11">The exp function</h3>
<div class="outline-text-3" id="text-7-11">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double exp (double x):</code>
</p>
<p>
Description
The exp function computes the exponential function of x. Arrange error
occurs if the magnitude of x is too large.
</p>
<p>
Returns
The exp function retums the exponential value.
</p>
</div>

</div>

<div id="outline-container-7-12" class="outline-3">
<h3 id="sec-7-12">The frexp function</h3>
<div class="outline-text-3" id="text-7-12">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double frexp(dbub1e value. int *exp);</code>
</p>
<p>
Description
The frexp function breaks a floating-point number into a normalized
fraction and an integral power of 2. It stores the integer in the i n t object pointed to by exp.
</p>
<p>
Returns
The frexp function returns the value x, such that x is a double with
magnitude in the interval [1/2, 1) or zero, and value equals x times 2
raised to the power *exp. If value is zero, both parts of the result are zero.
</p>


</div>

</div>

<div id="outline-container-7-13" class="outline-3">
<h3 id="sec-7-13">The ldexp function</h3>
<div class="outline-text-3" id="text-7-13">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>dbuble ldexp(doub1e x, int exp);</code>
</p>
<p>
Description
The ldexp function multiplies a floating-point number by an integral
power of 2. A range error may occur.
</p>
<p>
Returns
The ldexp function retunls the value of x times 2 raised to the power exp.
</p>
</div>

</div>

<div id="outline-container-7-14" class="outline-3">
<h3 id="sec-7-14">The log function</h3>
<div class="outline-text-3" id="text-7-14">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double log(double x);</code>
</p>
<p>
Description
The log function computes the natural logarithm of x. A domain error
occurs if the argument is negative. A range error may occur if the
argument is zero.
</p>
<p>
Returns
The log function returns the natural logarithm.
</p></div>

</div>

<div id="outline-container-7-15" class="outline-3">
<h3 id="sec-7-15">The log10 function</h3>
<div class="outline-text-3" id="text-7-15">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double log10 (double x);</code>
</p>
<p>
Description
The log10 function computes the base-ten logarithm of x. A domain
error occurs if the argument is negative. A range error may occur if
the argument is zero.
</p>
<p>
Return
The log10 function returns the base-ten logarithm.
</p></div>

</div>

<div id="outline-container-7-16" class="outline-3">
<h3 id="sec-7-16">The modf function</h3>
<div class="outline-text-3" id="text-7-16">

<p>Synopsis
<code>#include &lt;math.h&gt; =double modf(doub1e value, double aiptr);</code>
</p>
<p>
Description
The modf function breaks the argument value into integer and fraction
parts, each of which has the same sign as the argument. It stores the
integer part as a double in the object pointed to by iptr.
</p>
<p>
Returns
The modf function returns the signed fractional part of value.
</p></div>

</div>

<div id="outline-container-7-17" class="outline-3">
<h3 id="sec-7-17">The pow function</h3>
<div class="outline-text-3" id="text-7-17">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double pow(doub1e x, double y):</code>
</p>
<p>
Description
The p o w function computes x raised to the power y. A domain error
occurs if x is negative and y is not an integral value. A domain error
occurs if the result cannot be represented when x is zero and y is
less than or equal to zero. A range error may occur.
</p>
<p>
Returns
The p o w function returns the value of x raised to the power y.
</p>
</div>

</div>

<div id="outline-container-7-18" class="outline-3">
<h3 id="sec-7-18">The sqrt function</h3>
<div class="outline-text-3" id="text-7-18">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double mqrt(double x) ;</code>
</p>
<p>
Description
The sqrt function computes the nonnegative square root of x. A domain
error occurs if the argument is negative.
</p>
<p>
Returns
The sqrt function returns the value of the square root.
</p>
</div>

</div>

<div id="outline-container-7-19" class="outline-3">
<h3 id="sec-7-19">The ceil function</h3>
<div class="outline-text-3" id="text-7-19">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double ceil(doub1e x):</code>
</p>
<p>
Description
The ceil function computes the smallest integral value not less than x.
</p>
<p>
Returns
The ceil function returns the smallest integral value not less than x,
expressed as a double. 
</p>
</div>

</div>

<div id="outline-container-7-20" class="outline-3">
<h3 id="sec-7-20">The fabs function</h3>
<div class="outline-text-3" id="text-7-20">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double fabm(double x);</code>
</p>
<p>
Description
The fabs function computes the absolute value of a floating-point number X.
</p>
<p>
Returns
The fabs function returns the absolute value of X .
</p>
</div>

</div>

<div id="outline-container-7-21" class="outline-3">
<h3 id="sec-7-21">The floor function</h3>
<div class="outline-text-3" id="text-7-21">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double floor(doub1e x);</code>
</p>
<p>
Description
The floor function computes the largest integral value not greater than x.
</p>
<p>
Returns
The floor function returns the largest integral value not greater than x, expressed as a double.
</p>
</div>

</div>

<div id="outline-container-7-22" class="outline-3">
<h3 id="sec-7-22">The fmod function</h3>
<div class="outline-text-3" id="text-7-22">

<p>Synopsis
<code>#include &lt;math.h&gt;</code>
<code>double fmod(doublr x, double y ) ;</code>
</p>
<p>
Description
The fmod function computes the floating-point remainder of x/y.
</p>
<p>
Returns
The fmod function returns the value x - i * y, for some integer i such that, if y is nonzero,
the result has the same sign as x and magnitude less than the magnitude of y. If y is zero, whether
a domain error occurs or the fmod function returns zero is implementation-defined.
</p>
</div>
</div>

</div>
