src/BooksReview/The Standard C Library/The Standard C Library.org
* Chapter 8: <setjmp. h>

C implements nonlocal transfers of control by using library functions.
The header <setjmp. h> provides the necessary machinery:
+ jmp-buf the type jrq-buf, which you can think of as a label data-object type
+ longjmp the function longjmp, which performs the nonlocal transfer of control
+ setjmp the macro s e t jmp which stores information on the current
  calling context in a data object of type jmp-buf and which marks
  where you want control to pass on a corresponding long jmp call
* Chapter 9: <signal.h>
The header <signal .h> defines the code values for an open-ended set
of signals. It also declares two functions:
+ raise, which reports a synchronous signal
+ signal, which lets you specify the handling of a signal

You can handle a signal one of three ways:
+ default handling is to terminate execution, as described above
+ ignoring the signal effectively discards it
+ handling the signal causes control to pass to a function that you designate

* Chapter 10: <stdarg.h>

#+begin_src c
void va_start (va_list ap, paramN);
type va_arg (va_list ap, type)
void va_end (va_list ap);
#+end_src

* Chapter 11: <stddef.h>
The types are
=ptrdiff_t=
which is the signed integral type of the result of subtracting two
pointers;

=size_t=
which is the unsigned integral type of the result of the sizeof
operator; and

=wchar_t=
which is an integral type whose range of values can represent distinct codes for all members of
the largest extended character set specified among the supported locales;




* Chapter 12: <stdio.h>
** The perror function
Synopsis
=#include <stdio.h>=
=void perror(const char *s);=

Description
The perror function maps the error number in the integer expression errno to an error
message. It writes a sequence of characters to the standard error stream thus: first (if s is not a
null pointer and the character pointed to by s is not the null character), the string pointed to by s
followed by a colon (:) and a space; then an appropriate error message string followed by a
new-line character. The contents of the error message strings are the same as those returned by
the strerror function with argument ermo, which are implementation-defined

Returns
The perror function returns no value.

** print functions
The Standard C library provides six different print functions,
declared as follows:

=int fprintf (FILE *stream, const char *format, . .. );=
=int printf (const char *format, . . ) ;=
=int sprintf(char *dest, const char *format, ...) ;=
=int vfprintf (FILE *stream, const char *format, va- list ap);=
=int vprintf (const char *format, va- list ap);=
=int vsprintf (char *dest, const char *format, va-list ap);=

** scan functions
The Standard C library provides three different scan functions,
declared as follows:

=int fscanf (FILE *stream, const char *format, . . ) ;=
=int scanf (const char *format, . .. ) ;=
=int sscanf (char *src, const char *format, . .. ) ;=

* Chapter 13: <stdlib. h>
** function groups
To provide some structure for this chapter, I organize the functions into
groups six groups:
+ integer math (abs , div, labs, and ldiv) - performing simple integer
  arithmetic
+ algorithms (bsearch, qsort, rand, and srand) - capturing operations
  complex and widespread enough to warrant packaging as library
  functions
+ text conversions (atof, atoi, atol, strtod, strtol, and strtoul)
  - determining encoded arithmetic values from text representations 
+ multibyte conversions (mblen, mbstowcs, mbtowc, wcstombs, and
  wctomb) - mapping between multibyte and wide-character encodings
+ storage allocation (calloc, free, malloc, and realloc) - managing a
  heap of data objects
+ environmental interactions (abort, atexit, exit, getenv, and
  system)- interfacing between the program and the execution environment

** strtod
=double strtod (const char* str, char** endptr);=
Convert string to double

Parses the C-string str interpreting its content as a floating point
number and returns its value as a double. If endptr is not a null
pointer, the function also sets the value of endptr to point to the
first character after the number.


** strtoul
=unsigned long int strtoul (const char* str, char** endptr, int base);=

Convert string to unsigned long integer

Parses the C-string str, interpreting its content as an integral
number of the specified base, which is returned as an value of type
unsigned long int.

** getenv
=char* getenv (const char* name);=

Get environment string

Retrieves a C-string containing the value of the environment variable
whose name is specified as argument. If the requested variable is not
part of the environment list, the function returns a null pointer.

The pointer returned points to an internal memory block, whose content
or validity may be altered by further calls to getenv (but not by
other library functions).

The string pointed by the pointer returned by this function shall not
be modified by the program. Some systems and library implementations
may allow to change environmental variables with specific functions
(putenv, setenv...), but such functionality is non-portable.
** bsearch

#+begin_src c
void* bsearch (const void* key, const void* base,
               size_t num, size_t size,
               int (*compar)(const void*,const void*));
#+end_src
Binary search in array

Searches the given key in the array pointed by base that is formed by
num elements, each of size bytes, and returns a void* pointer to the
first entry in the table that matches the search key.

To perform the search, the function performs a series of calls to
compar with key as first argument and elements of the array pointed by
base as second argument.

Because this function may be optimized to use a non-linear search
algorithm (presumably a binary search), the elements that compare less
than key using compar should precede those that compare equal, and
these should precede those that compare greater. This requirement is
fulfilled by any array ordered with the same criteria used by compar
(as if sorted with qsort).

