public_html/Books Review/The Standard C Library/The Standard C Library.html

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Chapter 8: &lt;setjmp. h&gt;</h2>
<div class="outline-text-2" id="text-8">


<p>
C implements nonlocal transfers of control by using library functions.
The header &lt;setjmp. h&gt; provides the necessary machinery:
</p><ul>
<li>jmp-buf the type jrq-buf, which you can think of as a label data-object type
</li>
<li>longjmp the function longjmp, which performs the nonlocal transfer of control
</li>
<li>setjmp the macro s e t jmp which stores information on the current
  calling context in a data object of type jmp-buf and which marks
  where you want control to pass on a corresponding long jmp call
</li>
</ul>

</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">Chapter 9: &lt;signal.h&gt;</h2>
<div class="outline-text-2" id="text-9">

<p>The header &lt;signal .h&gt; defines the code values for an open-ended set
of signals. It also declares two functions:
</p><ul>
<li>raise, which reports a synchronous signal
</li>
<li>signal, which lets you specify the handling of a signal
</li>
</ul>


<p>
You can handle a signal one of three ways:
</p><ul>
<li>default handling is to terminate execution, as described above
</li>
<li>ignoring the signal effectively discards it
</li>
<li>handling the signal causes control to pass to a function that you designate
</li>
</ul>


</div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10">Chapter 10: &lt;stdarg.h&gt;</h2>
<div class="outline-text-2" id="text-10">





<pre class="src src-c"><span style="color: #98fb98;">void</span> <span style="color: #87cefa;">va_start</span> (<span style="color: #98fb98;">va_list</span> <span style="color: #eedd82;">ap</span>, paramN);
<span style="color: #98fb98;">type</span> <span style="color: #87cefa;">va_arg</span> (<span style="color: #98fb98;">va_list</span> <span style="color: #eedd82;">ap</span>, <span style="color: #98fb98;">type</span>)
<span style="color: #98fb98;">void</span> <span style="color: #87cefa;">va_end</span> (<span style="color: #98fb98;">va_list</span> <span style="color: #eedd82;">ap</span>);
</pre>


</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11">Chapter 11: &lt;stddef.h&gt;</h2>
<div class="outline-text-2" id="text-11">

<p>The types are
<code>ptrdiff_t</code>
which is the signed integral type of the result of subtracting two
pointers;
</p>
<p>
<code>size_t</code>
which is the unsigned integral type of the result of the sizeof
operator; and
</p>
<p>
<code>wchar_t</code>
which is an integral type whose range of values can represent distinct codes for all members of
the largest extended character set specified among the supported locales;
</p>



</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12">Chapter 12: &lt;stdio.h&gt;</h2>
<div class="outline-text-2" id="text-12">


</div>

<div id="outline-container-12-1" class="outline-3">
<h3 id="sec-12-1">The perror function</h3>
<div class="outline-text-3" id="text-12-1">

<p>Synopsis
<code>#include &lt;stdio.h&gt;</code>
<code>void perror(const char *s);</code>
</p>
<p>
Description
The perror function maps the error number in the integer expression errno to an error
message. It writes a sequence of characters to the standard error stream thus: first (if s is not a
null pointer and the character pointed to by s is not the null character), the string pointed to by s
followed by a colon (:) and a space; then an appropriate error message string followed by a
new-line character. The contents of the error message strings are the same as those returned by
the strerror function with argument ermo, which are implementation-defined
</p>
<p>
Returns
The perror function returns no value.
</p>
</div>

</div>

<div id="outline-container-12-2" class="outline-3">
<h3 id="sec-12-2">print functions</h3>
<div class="outline-text-3" id="text-12-2">

<p>The Standard C library provides six different print functions,
declared as follows:
</p>
<p>
<code>int fprintf (FILE *stream, const char *format, . .. );</code>
<code>int printf (const char *format, . . ) ;</code>
<code>int sprintf(char *dest, const char *format, ...) ;</code>
<code>int vfprintf (FILE *stream, const char *format, va- list ap);</code>
<code>int vprintf (const char *format, va- list ap);</code>
<code>int vsprintf (char *dest, const char *format, va-list ap);</code>
</p>
</div>

</div>

<div id="outline-container-12-3" class="outline-3">
<h3 id="sec-12-3">scan functions</h3>
<div class="outline-text-3" id="text-12-3">

<p>The Standard C library provides three different scan functions,
declared as follows:
</p>
<p>
<code>int fscanf (FILE *stream, const char *format, . . ) ;</code>
<code>int scanf (const char *format, . .. ) ;</code>
<code>int sscanf (char *src, const char *format, . .. ) ;</code>
</p>
</div>
</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13">Chapter 13: &lt;stdlib. h&gt;</h2>
<div class="outline-text-2" id="text-13">


</div>

<div id="outline-container-13-1" class="outline-3">
<h3 id="sec-13-1">function groups</h3>
<div class="outline-text-3" id="text-13-1">

<p>To provide some structure for this chapter, I organize the functions into
groups six groups:
</p><ul>
<li>integer math (abs , div, labs, and ldiv) - performing simple integer
  arithmetic
</li>
<li>algorithms (bsearch, qsort, rand, and srand) - capturing operations
  complex and widespread enough to warrant packaging as library
  functions
</li>
<li>text conversions (atof, atoi, atol, strtod, strtol, and strtoul)
<ul>
<li>determining encoded arithmetic values from text representations 
</li>
</ul>

</li>
<li>multibyte conversions (mblen, mbstowcs, mbtowc, wcstombs, and
  wctomb) - mapping between multibyte and wide-character encodings
</li>
<li>storage allocation (calloc, free, malloc, and realloc) - managing a
  heap of data objects
</li>
<li>environmental interactions (abort, atexit, exit, getenv, and
  system)- interfacing between the program and the execution environment
</li>
</ul>


</div>

</div>

<div id="outline-container-13-2" class="outline-3">
<h3 id="sec-13-2">strtod</h3>
<div class="outline-text-3" id="text-13-2">

<p><code>double strtod (const char* str, char** endptr);</code>
Convert string to double
</p>
<p>
Parses the C-string str interpreting its content as a floating point
number and returns its value as a double. If endptr is not a null
pointer, the function also sets the value of endptr to point to the
first character after the number.
</p>

</div>

</div>

<div id="outline-container-13-3" class="outline-3">
<h3 id="sec-13-3">strtoul</h3>
<div class="outline-text-3" id="text-13-3">

<p><code>unsigned long int strtoul (const char* str, char** endptr, int base);</code>
</p>
<p>
Convert string to unsigned long integer
</p>
<p>
Parses the C-string str, interpreting its content as an integral
number of the specified base, which is returned as an value of type
unsigned long int.
</p>
</div>

</div>

<div id="outline-container-13-4" class="outline-3">
<h3 id="sec-13-4">getenv</h3>
<div class="outline-text-3" id="text-13-4">

<p><code>char* getenv (const char* name);</code>
</p>
<p>
Get environment string
</p>
<p>
Retrieves a C-string containing the value of the environment variable
whose name is specified as argument. If the requested variable is not
part of the environment list, the function returns a null pointer.
</p>
<p>
The pointer returned points to an internal memory block, whose content
or validity may be altered by further calls to getenv (but not by
other library functions).
</p>
<p>
The string pointed by the pointer returned by this function shall not
be modified by the program. Some systems and library implementations
may allow to change environmental variables with specific functions
(putenv, setenv&hellip;), but such functionality is non-portable.
</p></div>

</div>

<div id="outline-container-13-5" class="outline-3">
<h3 id="sec-13-5">bsearch</h3>
<div class="outline-text-3" id="text-13-5">





<pre class="src src-c"><span style="color: #98fb98;">void</span>* <span style="color: #87cefa;">bsearch</span> (<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">void</span>* <span style="color: #eedd82;">key</span>, <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">void</span>* <span style="color: #eedd82;">base</span>,
               <span style="color: #98fb98;">size_t</span> <span style="color: #eedd82;">num</span>, <span style="color: #98fb98;">size_t</span> <span style="color: #eedd82;">size</span>,
               <span style="color: #98fb98;">int</span> (*<span style="color: #eedd82;">compar</span>)(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">void</span>*,<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">void</span>*));
</pre>

<p>
Binary search in array
</p>
<p>
Searches the given key in the array pointed by base that is formed by
num elements, each of size bytes, and returns a void* pointer to the
first entry in the table that matches the search key.
</p>
<p>
To perform the search, the function performs a series of calls to
compar with key as first argument and elements of the array pointed by
base as second argument.
</p>
<p>
Because this function may be optimized to use a non-linear search
algorithm (presumably a binary search), the elements that compare less
than key using compar should precede those that compare equal, and
these should precede those that compare greater. This requirement is
fulfilled by any array ordered with the same criteria used by compar
(as if sorted with qsort).
</p>
</div>

</div>
