src/BooksReview/The Standard C Library/The Standard C Library.org
** qsort
#+begin_src c
void qsort (void* base, size_t num, size_t size,
            int (*compar)(const void*,const void*));
#+end_src
Sort elements of array

Sorts the num elements of the array pointed by base, each element size
bytes long, using the compar function to determine the order.

The sorting algorithm used by this function compares pairs of elements
by calling the specified compar function with pointers to them as
argument.

The function does not return any value, but modifies the content of
the array pointed by base reordering its elements as defined by
compar.

The order of equivalent elements is undefined.

** div
#+begin_src c
div_t div (int numer, int denom);
typedef struct {
  int quot;
  int rem;
} div_t;
#+end_src
Integral division

Returns the integral quotient and remainder of the division of numer
by denom ( numer/denom ) as a structure of type div_t, ldiv_t or
lldiv_t, which has two members: quot and rem.

** mblen
=int mblen (const char* pmb, size_t max);=

Get length of multibyte character

Returns the size of the multibyte character pointed by pmb, examining
at most max bytes.

mblen has its own internal shift state, which is altered as necessary
only by calls to this function. A call to the function with a null
pointer as pmb resets the state (and returns whether multibyte
characters are state-dependent).

The behavior of this function depends on the LC_CTYPE category of the
selected C locale.
** mbtowc
=int mbtowc (wchar_t* pwc, const char* pmb, size_t max);=

Convert multibyte sequence to wide character

The multibyte character pointed by pmb is converted to a value of type
wchar_t and stored at the location pointed by pwc. The function
returns the length in bytes of the multibyte character.

mbtowc has its own internal shift state, which is altered as necessary
only by calls to this function. A call to the function with a null
pointer as pmb resets the state (and returns whether multibyte
characters are state-dependent).

The behavior of this function depends on the LC_CTYPE category of the
selected C locale.

** wctomb
=int wctomb (char* pmb, wchar_t wc);=

Convert wide character to multibyte sequence

The wide character wc is translated to its multibyte equivalent and
stored in the array pointed by pmb. The function returns the length in
bytes of the equivalent multibyte sequence pointed by pmb after the
call.

wctomb has its own internal shift state, which is altered as necessary
only by calls to this function. A call to the function with a null
pointer as pmb resets the state (and returns whether multibyte
sequences are state-dependent).

The behavior of this function depends on the LC_CTYPE category of the
selected C locale.
** mbstowcs
=size_t mbstowcs (wchar_t* dest, const char* src, size_t max);=

Convert multibyte string to wide-character string

Translates the multibyte sequence pointed by src to the equivalent
sequence of wide-characters (which is stored in the array pointed by
dest), up until either max wide characters have been translated or
until a null character is encountered in the multibyte sequence src
(which is also translated and stored, but not counted in the length
returned by the function).

If max characters are successfully translated, the resulting string
stored in dest is not null-terminated.

The behavior of this function depends on the LC_CTYPE category of the
selected C locale.


** wcstombs
=size_t wcstombs (char* dest, const wchar_t* src, size_t max);=

Convert wide-character string to multibyte string

Translates wide characters from the sequence pointed by src to the
multibyte equivalent sequence (which is stored at the array pointed by
dest), up until either max bytes have been translated or until a wide
characters translates into a null character.

If max bytes are successfully translated, the resulting string stored
in dest is not null-terminated.

The resulting multibyte sequence begins in the initial shift state (if
any).

The behavior of this function depends on the LC_CTYPE category of the
selected C locale.

* Chapter 14: <string.h>
** strcoll
=int strcoll ( const char * str1, const char * str2 );=

Compare two strings using locale

Compares the C string str1 to the C string str2, both interpreted appropriately according to the LC_COLLATE category of the C locale currently selected.

This function starts comparing the first character of each string. If they are equal to each other continues with the following pair until the characters differ or until a null-character signaling the end of a string is reached.

The behavior of this function depends on the LC_COLLATE category of the selected C locale.
** strxfrm
=size_t strxfrm ( char * destination, const char * source, size_t num );=

Transform string using locale

Transforms the C string pointed by source according to the current locale and copies the first num characters of the transformed string to destination, returning its length.

Alternativelly, the function can be used to only retrieve the length, by specifying a null pointer for destination and zero for num.

destination and source shall not overlap.

The behavior of this function depends on the LC_COLLATE category of the selected C locale.
** memchr
=const void * memchr ( const void * ptr, int value, size_t num );=
=void * memchr (       void * ptr, int value, size_t num );=

Locate character in block of memory

Searches within the first num bytes of the block of memory pointed by
ptr for the first occurrence of value (interpreted as an unsigned
char), and returns a pointer to it.

Both value and each of the bytes checked on the the ptr array are
interpreted as unsigned char for the comparison.


** strchr
=char *strchr(const char *str, int  c);=

Description

The strchr function locates the first occurrence of c (converted to a char) in the string
pointed to by s.The terminating null character is considered to be part of the string.

Returns

The strchr function returns a pointer to the located character. or a null pointer if the character
does not occur in the string.

