public_html/Books Review/The Standard C Library/The Standard C Library.html

<div id="outline-container-13-6" class="outline-3">
<h3 id="sec-13-6">qsort</h3>
<div class="outline-text-3" id="text-13-6">




<pre class="src src-c"><span style="color: #98fb98;">void</span> <span style="color: #87cefa;">qsort</span> (<span style="color: #98fb98;">void</span>* <span style="color: #eedd82;">base</span>, <span style="color: #98fb98;">size_t</span> <span style="color: #eedd82;">num</span>, <span style="color: #98fb98;">size_t</span> <span style="color: #eedd82;">size</span>,
            <span style="color: #98fb98;">int</span> (*<span style="color: #eedd82;">compar</span>)(<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">void</span>*,<span style="color: #00ffff;">const</span> <span style="color: #98fb98;">void</span>*));
</pre>

<p>
Sort elements of array
</p>
<p>
Sorts the num elements of the array pointed by base, each element size
bytes long, using the compar function to determine the order.
</p>
<p>
The sorting algorithm used by this function compares pairs of elements
by calling the specified compar function with pointers to them as
argument.
</p>
<p>
The function does not return any value, but modifies the content of
the array pointed by base reordering its elements as defined by
compar.
</p>
<p>
The order of equivalent elements is undefined.
</p>
</div>

</div>

<div id="outline-container-13-7" class="outline-3">
<h3 id="sec-13-7">div</h3>
<div class="outline-text-3" id="text-13-7">




<pre class="src src-c"><span style="color: #98fb98;">div_t</span> <span style="color: #87cefa;">div</span> (<span style="color: #98fb98;">int</span> <span style="color: #eedd82;">numer</span>, <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">denom</span>);
<span style="color: #00ffff;">typedef</span> <span style="color: #00ffff;">struct</span> {
  <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">quot</span>;
  <span style="color: #98fb98;">int</span> <span style="color: #eedd82;">rem</span>;
} <span style="color: #98fb98;">div_t</span>;
</pre>

<p>
Integral division
</p>
<p>
Returns the integral quotient and remainder of the division of numer
by denom ( numer/denom ) as a structure of type div<sub>t</sub>, ldiv<sub>t</sub> or
lldiv<sub>t</sub>, which has two members: quot and rem.
</p>
</div>

</div>

<div id="outline-container-13-8" class="outline-3">
<h3 id="sec-13-8">mblen</h3>
<div class="outline-text-3" id="text-13-8">

<p><code>int mblen (const char* pmb, size_t max);</code>
</p>
<p>
Get length of multibyte character
</p>
<p>
Returns the size of the multibyte character pointed by pmb, examining
at most max bytes.
</p>
<p>
mblen has its own internal shift state, which is altered as necessary
only by calls to this function. A call to the function with a null
pointer as pmb resets the state (and returns whether multibyte
characters are state-dependent).
</p>
<p>
The behavior of this function depends on the LC<sub>CTYPE</sub> category of the
selected C locale.
</p></div>

</div>

<div id="outline-container-13-9" class="outline-3">
<h3 id="sec-13-9">mbtowc</h3>
<div class="outline-text-3" id="text-13-9">

<p><code>int mbtowc (wchar_t* pwc, const char* pmb, size_t max);</code>
</p>
<p>
Convert multibyte sequence to wide character
</p>
<p>
The multibyte character pointed by pmb is converted to a value of type
wchar<sub>t</sub> and stored at the location pointed by pwc. The function
returns the length in bytes of the multibyte character.
</p>
<p>
mbtowc has its own internal shift state, which is altered as necessary
only by calls to this function. A call to the function with a null
pointer as pmb resets the state (and returns whether multibyte
characters are state-dependent).
</p>
<p>
The behavior of this function depends on the LC<sub>CTYPE</sub> category of the
selected C locale.
</p>
</div>

</div>

<div id="outline-container-13-10" class="outline-3">
<h3 id="sec-13-10">wctomb</h3>
<div class="outline-text-3" id="text-13-10">

<p><code>int wctomb (char* pmb, wchar_t wc);</code>
</p>
<p>
Convert wide character to multibyte sequence
</p>
<p>
The wide character wc is translated to its multibyte equivalent and
stored in the array pointed by pmb. The function returns the length in
bytes of the equivalent multibyte sequence pointed by pmb after the
call.
</p>
<p>
wctomb has its own internal shift state, which is altered as necessary
only by calls to this function. A call to the function with a null
pointer as pmb resets the state (and returns whether multibyte
sequences are state-dependent).
</p>
<p>
The behavior of this function depends on the LC<sub>CTYPE</sub> category of the
selected C locale.
</p></div>

</div>

<div id="outline-container-13-11" class="outline-3">
<h3 id="sec-13-11">mbstowcs</h3>
<div class="outline-text-3" id="text-13-11">

<p><code>size_t mbstowcs (wchar_t* dest, const char* src, size_t max);</code>
</p>
<p>
Convert multibyte string to wide-character string
</p>
<p>
Translates the multibyte sequence pointed by src to the equivalent
sequence of wide-characters (which is stored in the array pointed by
dest), up until either max wide characters have been translated or
until a null character is encountered in the multibyte sequence src
(which is also translated and stored, but not counted in the length
returned by the function).
</p>
<p>
If max characters are successfully translated, the resulting string
stored in dest is not null-terminated.
</p>
<p>
The behavior of this function depends on the LC<sub>CTYPE</sub> category of the
selected C locale.
</p>

</div>

</div>

<div id="outline-container-13-12" class="outline-3">
<h3 id="sec-13-12">wcstombs</h3>
<div class="outline-text-3" id="text-13-12">

<p><code>size_t wcstombs (char* dest, const wchar_t* src, size_t max);</code>
</p>
<p>
Convert wide-character string to multibyte string
</p>
<p>
Translates wide characters from the sequence pointed by src to the
multibyte equivalent sequence (which is stored at the array pointed by
dest), up until either max bytes have been translated or until a wide
characters translates into a null character.
</p>
<p>
If max bytes are successfully translated, the resulting string stored
in dest is not null-terminated.
</p>
<p>
The resulting multibyte sequence begins in the initial shift state (if
any).
</p>
<p>
The behavior of this function depends on the LC<sub>CTYPE</sub> category of the
selected C locale.
</p>
</div>
</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14">Chapter 14: &lt;string.h&gt;</h2>
<div class="outline-text-2" id="text-14">


</div>

<div id="outline-container-14-1" class="outline-3">
<h3 id="sec-14-1">strcoll</h3>
<div class="outline-text-3" id="text-14-1">

<p><code>int strcoll ( const char * str1, const char * str2 );</code>
</p>
<p>
Compare two strings using locale
</p>
<p>
Compares the C string str1 to the C string str2, both interpreted appropriately according to the LC<sub>COLLATE</sub> category of the C locale currently selected.
</p>
<p>
This function starts comparing the first character of each string. If they are equal to each other continues with the following pair until the characters differ or until a null-character signaling the end of a string is reached.
</p>
<p>
The behavior of this function depends on the LC<sub>COLLATE</sub> category of the selected C locale.
</p></div>

</div>

<div id="outline-container-14-2" class="outline-3">
<h3 id="sec-14-2">strxfrm</h3>
<div class="outline-text-3" id="text-14-2">

<p><code>size_t strxfrm ( char * destination, const char * source, size_t num );</code>
</p>
<p>
Transform string using locale
</p>
<p>
Transforms the C string pointed by source according to the current locale and copies the first num characters of the transformed string to destination, returning its length.
</p>
<p>
Alternativelly, the function can be used to only retrieve the length, by specifying a null pointer for destination and zero for num.
</p>
<p>
destination and source shall not overlap.
</p>
<p>
The behavior of this function depends on the LC<sub>COLLATE</sub> category of the selected C locale.
</p></div>

</div>

<div id="outline-container-14-3" class="outline-3">
<h3 id="sec-14-3">memchr</h3>
<div class="outline-text-3" id="text-14-3">

<p><code>const void * memchr ( const void * ptr, int value, size_t num );</code>
<code>void * memchr (       void * ptr, int value, size_t num );</code>
</p>
<p>
Locate character in block of memory
</p>
<p>
Searches within the first num bytes of the block of memory pointed by
ptr for the first occurrence of value (interpreted as an unsigned
char), and returns a pointer to it.
</p>
<p>
Both value and each of the bytes checked on the the ptr array are
interpreted as unsigned char for the comparison.
</p>

</div>

</div>

<div id="outline-container-14-4" class="outline-3">
<h3 id="sec-14-4">strchr</h3>
<div class="outline-text-3" id="text-14-4">

<p><code>char *strchr(const char *str, int  c);</code>
</p>
<p>
Description
</p>
<p>
The strchr function locates the first occurrence of c (converted to a char) in the string
pointed to by s.The terminating null character is considered to be part of the string.
</p>
<p>
Returns
</p>
<p>
The strchr function returns a pointer to the located character. or a null pointer if the character
does not occur in the string.
</p>
</div>

</div>
