src/BooksReview/The Standard C Library/The Standard C Library.org
** strcspn
=size_t strcspn ( const char * str1, const char * str2 );=

Get span until character in string

Scans str1 for the first occurrence of any of the characters that are
part of str2, returning the number of characters of str1 read before
this first occurrence.

The search includes the terminating null-characters. Therefore, the
function will return the length of str1 if none of the characters of
str2 are found in str1


** strpbrk
=const char * strpbrk ( const char * str1, const char * str2 );=
=char * strpbrk (       char * str1, const char * str2 );=

Locate characters in string

Returns a pointer to the first occurrence in str1 of any of the
characters that are part of str2, or a null pointer if there are no
matches.

The search does not include the terminating null-characters of either
strings, but ends there.

** strrchr
=const char * strrchr ( const char * str, int character );=
=char * strrchr (       char * str, int character );=

Locate last occurrence of character in string

Returns a pointer to the last occurrence of character in the C string
str.

The terminating null-character is considered part of the C string.
Therefore, it can also be located to retrieve a pointer to the end of
a string.


** strspn
=size_t strspn ( const char * str1, const char * str2 );=

Get span of character set in string

Returns the length of the initial portion of str1 which consists only
of characters that are part of str2.

The search does not include the terminating null-characters of either
strings, but ends there
** strtok
=char * strtok ( char * str, const char * delimiters );=

Split string into tokens

A sequence of calls to this function split str into tokens, which are
sequences of contiguous characters separated by any of the characters
that are part of delimiters.

On a first call, the function expects a C string as argument for str,
whose first character is used as the starting location to scan for
tokens. In subsequent calls, the function expects a null pointer and
uses the position right after the end of last token as the new
starting location for scanning.

To determine the beginning and the end of a token, the function first
scans from the starting location for the first character not contained
in delimiters (which becomes the beginning of the token). And then
scans starting from this beginning of the token for the first
character contained in delimiters, which becomes the end of the token.

This end of the token is automatically replaced by a null-character by
the function, and the beginning of the token is returned by the
function.

Once the terminating null character of str has been found in a call to
strtok, all subsequent calls to this function with a null pointer as
the first argument return a null pointer.

The point where the last token was found is kept internally by the
function to be used on the next call (particular library
implementations are not required to avoid data races).


** strerror
=char * strerror ( int errnum );=

Get pointer to error message string

Interprets the value of errnum, generating a string with a message
that describes the error condition as if set to errno by a function of
the library.

The returned pointer points to a statically allocated string, which
shall not be modified by the program. Further calls to this function
may overwrite its content (particular library implementations are not
required to avoid data races).

The error strings produced by strerror may be specific to each system
and library implementation.

* Chapter 15: <time.h>
** macro CLOCKS_PER_SEC
Clock ticks per second

This macro expands to an expression representing the number of clock
ticks per second.

Clock ticks are units of time of a constant but system-specific
length, as those returned by function clock.

Dividing a count of clock ticks by this expression yields the number
of seconds.

** clock_t and time_t
types declared are =size_t=.
** struct tm
#+begin_src c
  tm_sec  int     seconds after the minute        0-61*
  tm_min  int     minutes after the hour  0-59
  tm_hour int     hours since midnight    0-23
  tm_mday int     day of the month        1-31
  tm_mon  int     months since January    0-11
  tm_year int     years since 1900        
  tm_wday int     days since Sunday       0-6
  tm_yday int     days since January 1    0-365
  tm_isdst        int     Daylight Saving Time flag       
  The Daylight Saving Time flag (tm_isdst) is greater than zero if Daylight Saving Time is in effect, zero if Daylight Saving Time is not in effect, and less than zero if the information is not available.
  
   * tm_sec is generally 0-59. The extra range is to accommodate for leap seconds in certain systems.
#+end_src
** clock
=clock_t clock (void);=

Clock program

Returns the processor time consumed by the program.

The value returned is expressed in clock ticks, which are units of
time of a constant but system-specific length (with a relation of
CLOCKS_PER_SEC clock ticks per second).

The epoch used as reference by clock varies between systems, but it is
related to the program execution (generally its launch). To calculate
the actual processing time of a program, the value returned by clock
shall be compared to a value returned by a previous call to the same
function.

** difftime
=double difftime (time_t end, time_t beginning);=

Return difference between two times

Calculates the difference in seconds between beginning and end.
** mktime
=time_t mktime (struct tm * timeptr);=

Convert tm structure to time_t

Returns the value of type time_t that represents the local time
described by the tm structure pointed by timeptr (which may be
modified).

This function performs the reverse translation that localtime does.

The values of the members tm_wday and tm_yday of timeptr are ignored,
and the values of the other members are interpreted even if out of
their valid ranges (see struct tm). For example, tm_mday may contain
values above 31, which are interpreted accordingly as the days that
follow the last day of the selected month.

A call to this function automatically adjusts the values of the
members of timeptr if they are off-range or -in the case of tm_wday
and tm_yday- if they have values that do not match the date described
by the other members.

