public_html/Books Review/The Standard C Library/The Standard C Library.html

<div id="outline-container-14-5" class="outline-3">
<h3 id="sec-14-5">strcspn</h3>
<div class="outline-text-3" id="text-14-5">

<p><code>size_t strcspn ( const char * str1, const char * str2 );</code>
</p>
<p>
Get span until character in string
</p>
<p>
Scans str1 for the first occurrence of any of the characters that are
part of str2, returning the number of characters of str1 read before
this first occurrence.
</p>
<p>
The search includes the terminating null-characters. Therefore, the
function will return the length of str1 if none of the characters of
str2 are found in str1
</p>

</div>

</div>

<div id="outline-container-14-6" class="outline-3">
<h3 id="sec-14-6">strpbrk</h3>
<div class="outline-text-3" id="text-14-6">

<p><code>const char * strpbrk ( const char * str1, const char * str2 );</code>
<code>char * strpbrk (       char * str1, const char * str2 );</code>
</p>
<p>
Locate characters in string
</p>
<p>
Returns a pointer to the first occurrence in str1 of any of the
characters that are part of str2, or a null pointer if there are no
matches.
</p>
<p>
The search does not include the terminating null-characters of either
strings, but ends there.
</p>
</div>

</div>

<div id="outline-container-14-7" class="outline-3">
<h3 id="sec-14-7">strrchr</h3>
<div class="outline-text-3" id="text-14-7">

<p><code>const char * strrchr ( const char * str, int character );</code>
<code>char * strrchr (       char * str, int character );</code>
</p>
<p>
Locate last occurrence of character in string
</p>
<p>
Returns a pointer to the last occurrence of character in the C string
str.
</p>
<p>
The terminating null-character is considered part of the C string.
Therefore, it can also be located to retrieve a pointer to the end of
a string.
</p>

</div>

</div>

<div id="outline-container-14-8" class="outline-3">
<h3 id="sec-14-8">strspn</h3>
<div class="outline-text-3" id="text-14-8">

<p><code>size_t strspn ( const char * str1, const char * str2 );</code>
</p>
<p>
Get span of character set in string
</p>
<p>
Returns the length of the initial portion of str1 which consists only
of characters that are part of str2.
</p>
<p>
The search does not include the terminating null-characters of either
strings, but ends there
</p></div>

</div>

<div id="outline-container-14-9" class="outline-3">
<h3 id="sec-14-9">strtok</h3>
<div class="outline-text-3" id="text-14-9">

<p><code>char * strtok ( char * str, const char * delimiters );</code>
</p>
<p>
Split string into tokens
</p>
<p>
A sequence of calls to this function split str into tokens, which are
sequences of contiguous characters separated by any of the characters
that are part of delimiters.
</p>
<p>
On a first call, the function expects a C string as argument for str,
whose first character is used as the starting location to scan for
tokens. In subsequent calls, the function expects a null pointer and
uses the position right after the end of last token as the new
starting location for scanning.
</p>
<p>
To determine the beginning and the end of a token, the function first
scans from the starting location for the first character not contained
in delimiters (which becomes the beginning of the token). And then
scans starting from this beginning of the token for the first
character contained in delimiters, which becomes the end of the token.
</p>
<p>
This end of the token is automatically replaced by a null-character by
the function, and the beginning of the token is returned by the
function.
</p>
<p>
Once the terminating null character of str has been found in a call to
strtok, all subsequent calls to this function with a null pointer as
the first argument return a null pointer.
</p>
<p>
The point where the last token was found is kept internally by the
function to be used on the next call (particular library
implementations are not required to avoid data races).
</p>

</div>

</div>

<div id="outline-container-14-10" class="outline-3">
<h3 id="sec-14-10">strerror</h3>
<div class="outline-text-3" id="text-14-10">

<p><code>char * strerror ( int errnum );</code>
</p>
<p>
Get pointer to error message string
</p>
<p>
Interprets the value of errnum, generating a string with a message
that describes the error condition as if set to errno by a function of
the library.
</p>
<p>
The returned pointer points to a statically allocated string, which
shall not be modified by the program. Further calls to this function
may overwrite its content (particular library implementations are not
required to avoid data races).
</p>
<p>
The error strings produced by strerror may be specific to each system
and library implementation.
</p>
</div>
</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15">Chapter 15: &lt;time.h&gt;</h2>
<div class="outline-text-2" id="text-15">


</div>

<div id="outline-container-15-1" class="outline-3">
<h3 id="sec-15-1">macro CLOCKS<sub>PER</sub><sub>SEC</sub></h3>
<div class="outline-text-3" id="text-15-1">

<p>Clock ticks per second
</p>
<p>
This macro expands to an expression representing the number of clock
ticks per second.
</p>
<p>
Clock ticks are units of time of a constant but system-specific
length, as those returned by function clock.
</p>
<p>
Dividing a count of clock ticks by this expression yields the number
of seconds.
</p>
</div>

</div>

<div id="outline-container-15-2" class="outline-3">
<h3 id="sec-15-2">clock<sub>t</sub> and time<sub>t</sub></h3>
<div class="outline-text-3" id="text-15-2">

<p>types declared are <code>size_t</code>.
</p></div>

</div>

<div id="outline-container-15-3" class="outline-3">
<h3 id="sec-15-3">struct tm</h3>
<div class="outline-text-3" id="text-15-3">




<pre class="src src-c">tm_sec  <span style="color: #98fb98;">int</span>     <span style="color: #87cefa;">seconds</span> after the minute        0-61*
tm_min  <span style="color: #98fb98;">int</span>     minutes after the hour  0-59
tm_hour <span style="color: #98fb98;">int</span>     hours since midnight    0-23
tm_mday <span style="color: #98fb98;">int</span>     day of the month        1-31
tm_mon  <span style="color: #98fb98;">int</span>     months since January    0-11
tm_year <span style="color: #98fb98;">int</span>     years since 1900        
tm_wday <span style="color: #98fb98;">int</span>     days since Sunday       0-6
tm_yday <span style="color: #98fb98;">int</span>     days since January 1    0-365
tm_isdst        <span style="color: #98fb98;">int</span>     Daylight Saving Time flag       
The Daylight Saving Time flag (tm_isdst) is greater <span style="color: #98fb98;">than</span> <span style="color: #eedd82;">zero</span> <span style="color: #00ffff;">if</span> Daylight Saving Time is in effect, <span style="color: #eedd82;">zero</span> <span style="color: #00ffff;">if</span> Daylight Saving Time is not in effect, <span style="color: #eedd82;">and</span> less than zero <span style="color: #00ffff;">if</span> the information is not available.

 * tm_sec is generally 0-59. The extra range is to accommodate <span style="color: #00ffff;">for</span> leap seconds in certain systems.
</pre>

</div>

</div>

<div id="outline-container-15-4" class="outline-3">
<h3 id="sec-15-4">clock</h3>
<div class="outline-text-3" id="text-15-4">

<p><code>clock_t clock (void);</code>
</p>
<p>
Clock program
</p>
<p>
Returns the processor time consumed by the program.
</p>
<p>
The value returned is expressed in clock ticks, which are units of
time of a constant but system-specific length (with a relation of
CLOCKS<sub>PER</sub><sub>SEC</sub> clock ticks per second).
</p>
<p>
The epoch used as reference by clock varies between systems, but it is
related to the program execution (generally its launch). To calculate
the actual processing time of a program, the value returned by clock
shall be compared to a value returned by a previous call to the same
function.
</p>
</div>

</div>

<div id="outline-container-15-5" class="outline-3">
<h3 id="sec-15-5">difftime</h3>
<div class="outline-text-3" id="text-15-5">

<p><code>double difftime (time_t end, time_t beginning);</code>
</p>
<p>
Return difference between two times
</p>
<p>
Calculates the difference in seconds between beginning and end.
</p></div>

</div>

<div id="outline-container-15-6" class="outline-3">
<h3 id="sec-15-6">mktime</h3>
<div class="outline-text-3" id="text-15-6">

<p><code>time_t mktime (struct tm * timeptr);</code>
</p>
<p>
Convert tm structure to time<sub>t</sub>
</p>
<p>
Returns the value of type time<sub>t</sub> that represents the local time
described by the tm structure pointed by timeptr (which may be
modified).
</p>
<p>
This function performs the reverse translation that localtime does.
</p>
<p>
The values of the members tm<sub>wday</sub> and tm<sub>yday</sub> of timeptr are ignored,
and the values of the other members are interpreted even if out of
their valid ranges (see struct tm). For example, tm<sub>mday</sub> may contain
values above 31, which are interpreted accordingly as the days that
follow the last day of the selected month.
</p>
<p>
A call to this function automatically adjusts the values of the
members of timeptr if they are off-range or -in the case of tm<sub>wday</sub>
and tm<sub>yday</sub>- if they have values that do not match the date described
by the other members.
</p>
</div>

</div>
