src/BooksReview/The Standard C Library/The Standard C Library.org
** time
=time_t time (time_t* timer);=

Get current time

Get the current calendar time as a value of type time_t.

The function returns this value, and if the argument is not a null
pointer, it also sets this value to the object pointed by timer.

The value returned generally represents the number of seconds since
00:00 hours, Jan 1, 1970 UTC (i.e., the current unix timestamp).
Although libraries may use a different representation of time:
Portable programs should not use the value returned by this function
directly, but always rely on calls to other elements of the standard
library to translate them to portable types (such as localtime, gmtime
or difftime).

#+begin_src c
 time_t timer;
time(&timer);  /* get current time; same as: timer = time(NULL)  */
#+end_src

** asctime
=char* asctime (const struct tm * timeptr);=

Convert tm structure to string

Interprets the contents of the tm structure pointed by timeptr as a calendar time and converts it to a C-string containing a human-readable version of the corresponding date and time.

The returned string has the following format:

=Www Mmm dd hh:mm:ss yyyy=

Where Www is the weekday, Mmm the month (in letters), dd the day of
the month, hh:mm:ss the time, and yyyy the year.

The string is followed by a new-line character ('\n') and terminated
with a null-character.
** ctime
=char* ctime (const time_t * timer);=

Convert time_t value to string

Interprets the value pointed by timer as a calendar time and converts
it to a C-string containing a human-readable version of the
corresponding time and date, in terms of local time.

The returned string has the following format:

=Www Mmm dd hh:mm:ss yyyy=

Where Www is the weekday, Mmm the month (in letters), dd the day of
the month, hh:mm:ss the time, and yyyy the year.

The string is followed by a new-line character ('\n') and terminated
with a null-character.

This function is equivalent to: 
 
=asctime(localtime(timer))=


** gmtime
=struct tm * gmtime (const time_t * timer);=

Convert time_t to tm as UTC time

Uses the value pointed by timer to fill a tm structure with the values
that represent the corresponding time, expressed as a UTC time (i.e.,
the time at the GMT timezone).

For a local time alternative, see localtime.
** localtime
=struct tm * localtime (const time_t * timer);=

Convert time_t to tm as local time

Uses the value pointed by timer to fill a tm structure with the values
that represent the corresponding time, expressed for the local
timezone.
** strftime
#+begin_src c
size_t strftime (char* ptr, size_t maxsize, const char* format,
                 const struct tm* timeptr );
#+end_src
Format time as string

Copies into ptr the content of format, expanding its format specifiers
into the corresponding values that represent the time described in
timeptr, with a limit of maxsize characters.

#+begin_src c
ormat
C string containing any combination of regular characters and special format specifiers. These format specifiers are replaced by the function to the corresponding values to represent the time specified in timeptr. They all begin with a percentage (%) sign, and are:
specifier	Replaced by	Example
%a	Abbreviated weekday name *	Thu
%A	Full weekday name *	Thursday
%b	Abbreviated month name *	Aug
%B	Full month name *	August
%c	Date and time representation *	Thu Aug 23 14:55:02 2001
%C	Year divided by 100 and truncated to integer (00-99)	20
%d	Day of the month, zero-padded (01-31)	23
%D	Short MM/DD/YY date, equivalent to %m/%d/%y	08/23/01
%e	Day of the month, space-padded ( 1-31)	23
%F	Short YYYY-MM-DD date, equivalent to %Y-%m-%d	2001-08-23
%g	Week-based year, last two digits (00-99)	01
%g	Week-based year	2001
%h	Abbreviated month name * (same as %b)	Aug
%H	Hour in 24h format (00-23)	14
%I	Hour in 12h format (01-12)	02
%j	Day of the year (001-366)	235
%m	Month as a decimal number (01-12)	08
%M	Minute (00-59)	55
%n	New-line character ('\n')	
%p	AM or PM designation	PM
%r	12-hour clock time *	02:55:02 pm
%R	24-hour HH:MM time, equivalent to %H:%M	14:55
%S	Second (00-61)	02
%t	Horizontal-tab character ('\t')	
%T	ISO 8601 time format (HH:MM:SS), equivalent to %H:%M:%S	14:55
%u	ISO 8601 weekday as number with Monday as 1 (1-7)	4
%U	Week number with the first Sunday as the first day of week one (00-53)	33
%V	ISO 8601 week number (00-53)	34
%w	Weekday as a decimal number with Sunday as 0 (0-6)	4
%W	Week number with the first Monday as the first day of week one (00-53)	34
%x	Date representation *	08/23/01
%X	Time representation *	14:55:02
%y	Year, last two digits (00-99)	01
%Y	Year	2001
%z	ISO 8601 offset from UTC in timezone (1 minute=1, 1 hour=100)
If timezone cannot be termined, no characters	+100
%Z	Timezone name or abbreviation *
If timezone cannot be termined, no characters	CDT
%%	A % sign	%
#+end_src

