public_html/Books Review/The Standard C Library/The Standard C Library.html

<div id="outline-container-15-7" class="outline-3">
<h3 id="sec-15-7">time</h3>
<div class="outline-text-3" id="text-15-7">

<p><code>time_t time (time_t* timer);</code>
</p>
<p>
Get current time
</p>
<p>
Get the current calendar time as a value of type time<sub>t</sub>.
</p>
<p>
The function returns this value, and if the argument is not a null
pointer, it also sets this value to the object pointed by timer.
</p>
<p>
The value returned generally represents the number of seconds since
00:00 hours, Jan 1, 1970 UTC (i.e., the current unix timestamp).
Although libraries may use a different representation of time:
Portable programs should not use the value returned by this function
directly, but always rely on calls to other elements of the standard
library to translate them to portable types (such as localtime, gmtime
or difftime).
</p>



<pre class="src src-c"> <span style="color: #98fb98;">time_t</span> <span style="color: #eedd82;">timer</span>;
time(&amp;timer);  <span style="color: #ff7f24;">/* </span><span style="color: #ff7f24;">get current time; same as: timer = time(NULL)  </span><span style="color: #ff7f24;">*/</span>
</pre>


</div>

</div>

<div id="outline-container-15-8" class="outline-3">
<h3 id="sec-15-8">asctime</h3>
<div class="outline-text-3" id="text-15-8">

<p><code>char* asctime (const struct tm * timeptr);</code>
</p>
<p>
Convert tm structure to string
</p>
<p>
Interprets the contents of the tm structure pointed by timeptr as a calendar time and converts it to a C-string containing a human-readable version of the corresponding date and time.
</p>
<p>
The returned string has the following format:
</p>
<p>
<code>Www Mmm dd hh:mm:ss yyyy</code>
</p>
<p>
Where Www is the weekday, Mmm the month (in letters), dd the day of
the month, hh:mm:ss the time, and yyyy the year.
</p>
<p>
The string is followed by a new-line character ('\n') and terminated
with a null-character.
</p></div>

</div>

<div id="outline-container-15-9" class="outline-3">
<h3 id="sec-15-9">ctime</h3>
<div class="outline-text-3" id="text-15-9">

<p><code>char* ctime (const time_t * timer);</code>
</p>
<p>
Convert time<sub>t</sub> value to string
</p>
<p>
Interprets the value pointed by timer as a calendar time and converts
it to a C-string containing a human-readable version of the
corresponding time and date, in terms of local time.
</p>
<p>
The returned string has the following format:
</p>
<p>
<code>Www Mmm dd hh:mm:ss yyyy</code>
</p>
<p>
Where Www is the weekday, Mmm the month (in letters), dd the day of
the month, hh:mm:ss the time, and yyyy the year.
</p>
<p>
The string is followed by a new-line character ('\n') and terminated
with a null-character.
</p>
<p>
This function is equivalent to: 
</p>
<p> 
<code>asctime(localtime(timer))</code>
</p>

</div>

</div>

<div id="outline-container-15-10" class="outline-3">
<h3 id="sec-15-10">gmtime</h3>
<div class="outline-text-3" id="text-15-10">

<p><code>struct tm * gmtime (const time_t * timer);</code>
</p>
<p>
Convert time<sub>t</sub> to tm as UTC time
</p>
<p>
Uses the value pointed by timer to fill a tm structure with the values
that represent the corresponding time, expressed as a UTC time (i.e.,
the time at the GMT timezone).
</p>
<p>
For a local time alternative, see localtime.
</p></div>

</div>

<div id="outline-container-15-11" class="outline-3">
<h3 id="sec-15-11">localtime</h3>
<div class="outline-text-3" id="text-15-11">

<p><code>struct tm * localtime (const time_t * timer);</code>
</p>
<p>
Convert time<sub>t</sub> to tm as local time
</p>
<p>
Uses the value pointed by timer to fill a tm structure with the values
that represent the corresponding time, expressed for the local
timezone.
</p></div>

</div>

<div id="outline-container-15-12" class="outline-3">
<h3 id="sec-15-12">strftime</h3>
<div class="outline-text-3" id="text-15-12">




<pre class="src src-c"><span style="color: #98fb98;">size_t</span> <span style="color: #87cefa;">strftime</span> (<span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">ptr</span>, <span style="color: #98fb98;">size_t</span> <span style="color: #eedd82;">maxsize</span>, <span style="color: #00ffff;">const</span> <span style="color: #98fb98;">char</span>* <span style="color: #eedd82;">format</span>,
                 <span style="color: #00ffff;">const</span> <span style="color: #00ffff;">struct</span> <span style="color: #98fb98;">tm</span>* <span style="color: #eedd82;">timeptr</span> );
</pre>

<p>
Format time as string
</p>
<p>
Copies into ptr the content of format, expanding its format specifiers
into the corresponding values that represent the time described in
timeptr, with a limit of maxsize characters.
</p>



<pre class="src src-c">ormat
C string containing any combination of regular characters and special <span style="color: #98fb98;">format</span> <span style="color: #87cefa;">specifiers</span>. These format specifiers are replaced by the function to the corresponding values to represent the time specified in timeptr. They all begin with a percentage (%) sign, <span style="color: #98fb98;">and</span> <span style="color: #87cefa;">are</span>:
specifier       Replaced by     Example
%a      Abbreviated weekday name *      Thu
%A      Full weekday name *     Thursday
%b      Abbreviated month name *        Aug
%B      Full month name *       August
%c      Date and time representation *  Thu Aug 23 14:55:02 2001
%C      Year divided by 100 and truncated to integer (00-99)    20
%d      Day of the month, zero-padded (01-31)   23
%D      Short MM/DD/YY date, <span style="color: #98fb98;">equivalent</span> <span style="color: #eedd82;">to</span> %m/%d/%y     08/23/01
%e      Day of the month, space-padded ( 1-31)  23
%F      Short YYYY-MM-DD date, <span style="color: #98fb98;">equivalent</span> <span style="color: #eedd82;">to</span> %Y-%m-%d   2001-08-23
%g      Week-based year, last <span style="color: #98fb98;">two</span> <span style="color: #87cefa;">digits</span> (00-99)        01
%g      Week-based year 2001
%h      Abbreviated month name * (<span style="color: #98fb98;">same</span> <span style="color: #eedd82;">as</span> %b)   Aug
%H      Hour in 24h format (00-23)      14
%I      Hour in 12h format (01-12)      02
%j      Day of the year (001-366)       235
%m      Month as a decimal number (01-12)       08
%M      Minute (00-59)  55
%n      New-line character (<span style="color: #ffa07a;">'\n'</span>)       
%p      AM or PM designation    PM
%r      12-hour clock time *    02:55:02 pm
%R      24-hour HH:MM time, <span style="color: #98fb98;">equivalent</span> <span style="color: #87cefa;">to</span> %H:%M 14:55
%S      Second (00-61)  02
%t      Horizontal-tab character (<span style="color: #ffa07a;">'\t'</span>) 
%T      ISO 8601 time format (HH:MM:SS), <span style="color: #98fb98;">equivalent</span> <span style="color: #87cefa;">to</span> %H:%M:%S 14:55
%u      ISO 8601 weekday as number with Monday as 1 (1-7)       4
%U      Week number with the first Sunday as the first day of week one (00-53)  33
%V      ISO 8601 week number (00-53)    34
%w      Weekday as a decimal number with Sunday as 0 (0-6)      4
%W      Week number with the first Monday as the first day of week one (00-53)  34
%x      Date representation *   08/23/01
%X      Time representation *   14:55:02
%y      Year, last <span style="color: #98fb98;">two</span> <span style="color: #87cefa;">digits</span> (00-99)   01
%Y      Year    2001
%z      ISO 8601 offset from UTC in timezone (1 minute=1, 1 hour=100)
If timezone cannot <span style="color: #98fb98;">be</span> <span style="color: #eedd82;">termined</span>, <span style="color: #eedd82;">no</span> characters   +100
%Z      Timezone name or abbreviation *
If timezone cannot be termined, <span style="color: #eedd82;">no</span> characters   CDT
%%      A % sign        %
</pre>


</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-05-10T22:35+0800</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
